In [40]:
import pandas as pd

In [158]:
meteors     = pd.read_csv('../data/meteorites/Meteorite_Landings.csv')
books       = pd.read_csv('../data/goodreads-10k/books.csv')
movies      = pd.read_csv('../data/wiki-movies/wiki_movie_plots_deduped.csv')
airports    = pd.read_csv('../data/airports/airports.csv')
chef        = pd.read_csv('../data/restaurants/chefmozcuisine.csv')
zoo         = pd.read_csv('../data/zoo/zoo.csv')

dfs = {
    'meteors':  meteors,
    'books':    books,
    'movies':   movies,
    'airports': airports,
    'chef':     chef,
    'zoo':      zoo,
}

In [41]:
dfs = {
    'meteors':  meteors,
    'books':    books,
    'movies':   movies,
    'airports': airports,
    'chef':     chef,
    'zoo':      zoo,
}

In [46]:
# pure python / pandas
for k, df in dfs.items():
    print(k, df.shape)

meteors (45716, 10)
books (10000, 23)
movies (34886, 8)
airports (74977, 18)
chef (916, 2)
zoo (101, 18)

In [47]:
[(k, df.shape) for k, df in dfs.items()]

[('meteors', (45716, 10)),
 ('books', (10000, 23)),
 ('movies', (34886, 8)),
 ('airports', (74977, 18)),
 ('chef', (916, 2)),
 ('zoo', (101, 18))]

### inplace=True / overwriting a df

In [65]:
meteors.shape

(45716, 10)

In [66]:
meteors = meteors.dropna(inplace=False)

In [67]:
meteors.shape

(38115, 10)

In [52]:
# inplace for df operations
meteors.isna().sum(axis=0)

name              0
id                0
nametype          0
recclass          0
mass (g)        131
fall              0
year            291
reclat         7315
reclong        7315
GeoLocation    7315
dtype: int64

In [71]:
books['new_col'] = 17

In [84]:
max_num_authors = books['authors'].map(lambda elem: elem.count(",")).max()
max_num_authors

46

In [88]:
authors_df = pd.DataFrame(data = [[1,2,3], [4,5,6]], columns=['a','b','c'])
authors_df

   a  b  c
0  1  2  3
1  4  5  6

In [ ]:
players = []
for i in range(3):
    players.append("player" + str(i))

In [118]:
cols = ['author_' + str(num) for num in range(46)]
authors_df = pd.DataFrame(data = [], columns=cols)
authors_df

Empty DataFrame
Columns: [author_0, author_1, author_2, author_3, author_4, author_5, author_6, author_7, author_8, author_9, author_10, author_11, author_12, author_13, author_14, author_15, author_16, author_17, author_18, author_19, author_20, author_21, author_22, author_23, author_24, author_25, author_26, author_27, author_28, author_29, author_30, author_31, author_32, author_33, author_34, author_35, author_36, author_37, author_38, author_39, author_40, author_41, author_42, author_43, author_44, author_45]
Index: []

[0 rows x 46 columns]

In [96]:
s = "will, ben"
l = s.split(",")
l[1]

' ben'

In [104]:
def split_author(s, ind):
    try: val = s.split(",")[ind]
    except: val = ""
    return val

In [109]:
books['num_authors'] = books['authors'].map(lambda e: e.count(","))

In [123]:
books_many = books[books['num_authors'] > 5]
print(books_many.shape)
# books_many.head(5)

(34, 25)

In [121]:

for i in range(max_num_authors):
    authors_df["author_" + str(i)] = books_many['authors'].map(lambda e: split_author(e, i))

In [124]:
# authors_df

In [79]:
for row in books[:20]:
    print(row['authors'])

TypeError: string indices must be integers

### GroupBy + Aggregate

In [129]:
meteors.head(3)

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.21667, -113.0)"

In [139]:
meteors['recclass'].value_counts()

L6                7519
H5                6243
H6                3898
H4                3880
L5                3264
                  ...
H4(?)                1
Relict iron          1
EL4/5                1
L5-7                 1
Mesosiderite-C       1
Name: recclass, Length: 422, dtype: int64

In [150]:
meteors2 = meteors.copy()
meteors2['mass (g)'] = meteors['mass (g)'].astype(str)

In [152]:
meteors[["year", "mass (g)", "recclass"]].groupby("year").agg("count")

meteors2[:100][["year", "mass (g)", "nametype", "recclass"]].groupby(["year", "recclass"]).agg(["count", "sum", "min", "max"])

                   mass (g)                            nametype                \
                      count      sum      min      max    count    sum    min
year   recclass
1766.0 L/LL4              1   2000.0   2000.0   2000.0        1  Valid  Valid
1790.0 H5                 1   6400.0   6400.0   6400.0        1  Valid  Valid
1798.0 LL4                1   3700.0   3700.0   3700.0        1  Valid  Valid
1803.0 L6                 1   3200.0   3200.0   3200.0        1  Valid  Valid
1805.0 H6                 1     41.0     41.0     41.0        1  Valid  Valid
...                     ...      ...      ...      ...      ...    ...    ...
2006.0 H5                 1  29560.0  29560.0  29560.0        1  Valid  Valid
2008.0 L6                 1    270.0    270.0    270.0        1  Valid  Valid
       Ureilite-an        1   3950.0   3950.0   3950.0        1  Valid  Valid
2009.0 L6                 1   9500.0   9500.0   9500.0        1  Valid  Valid
2012.0 L6                 1   2900.0   2900.0   2900.0        1  Valid  Valid


                      max
year   recclass
1766.0 L/LL4        Valid
1790.0 H5           Valid
1798.0 LL4          Valid
1803.0 L6           Valid
1805.0 H6           Valid
...                   ...
2006.0 H5           Valid
2008.0 L6           Valid
       Ureilite-an  Valid
2009.0 L6           Valid
2012.0 L6           Valid

[99 rows x 8 columns]

In [137]:
# meteors.groupby("year").agg(["count", "sum"])

In [77]:
"," in books['authors']

False

In [169]:
bad = "107,000"

df = pd.DataFrame({
    'a': [1,2],
    'b': [0.7, bad]
})

df

   a        b
0  1      0.7
1  2  107,000

In [178]:
# df['b'].str.replace(',', '').astype(int)
def foo(x):
    try:
        return pd.to_numeric(x
                            #  , errors='coerce')
        )
    except:
        return 0
    

try: df['b'].apply(foo).astype(int)
df['b'].apply(foo).astype(int)
# 
#

0    0
1    0
Name: b, dtype: int32

### apply!

In [155]:
pd.isna(meteors)

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
45711,False,False,False,False,False,False,False,False,False,False
45712,False,False,False,False,False,False,False,False,False,False
45713,False,False,False,False,False,False,False,False,False,False
45714,False,False,False,False,False,False,False,False,False,False
45715,False,False,False,False,False,False,False,False,False,False

In [157]:
meteors.shape

(38115, 10)

In [160]:


meteors.isna().apply(sum, axis=1)

0        0
1        0
2        0
3        0
4        0
        ..
45711    0
45712    0
45713    0
45714    0
45715    0
Length: 45716, dtype: int64

In [168]:
pd.options.display.max_rows = 9
pd.options.display.max_cols = 9
zoo

,animal_name,hair,feathers,eggs,milk,airborne,aquatic,predator,toothed,backbone,breathes,venomous,fins,legs,tail,domestic,catsize,class_type
0,aardvark,1,0,0,1,0,0,1,1,1,1,0,0,4,0,0,1,1
1,antelope,1,0,0,1,0,0,0,1,1,1,0,0,4,1,0,1,1
2,bass,0,0,1,0,0,1,1,1,1,0,0,1,0,1,0,0,4
3,bear,1,0,0,1,0,0,1,1,1,1,0,0,4,0,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
97,wasp,1,0,1,0,1,0,0,0,0,1,1,0,6,0,0,0,6
98,wolf,1,0,0,1,0,0,1,1,1,1,0,0,4,1,0,1,1
99,worm,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,7
100,wren,0,1,1,0,1,0,0,0,1,1,0,0,2,1,0,0,2

In [159]:
meteors.isna().apply(sum, axis=0)

name              0
id                0
nametype          0
recclass          0
mass (g)        131
fall              0
year            291
reclat         7315
reclong        7315
GeoLocation    7315
dtype: int64

In [165]:
# apply as "mega" .map
def foo(row):
    return row['mass (g)'] + row['year']

meteors["mass_plus_year"] = meteors.apply(lambda row: foo(row), axis=1 )
meteors.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation,mass_plus_year
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775, 6.08333)",1901.0
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.18333, 10.23333)",2671.0
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.21667, -113.0)",108952.0
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.88333,-99.90000,"(16.88333, -99.9)",3890.0
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.16667,-64.95000,"(-33.16667, -64.95)",2682.0

In [162]:
meteors[['mass (g)', 'year']]

       mass (g)    year
0          21.0  1880.0
1         720.0  1951.0
2      107000.0  1952.0
3        1914.0  1976.0
4         780.0  1902.0
...         ...     ...
45711     172.0  1990.0
45712      46.0  1999.0
45713       3.3  1939.0
45714    2167.0  2003.0
45715     200.0  1976.0

[45716 rows x 2 columns]